fixed_bottleneck/original/httperf/test1.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=44.252.104.243 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.05 --send-buffer=4096 --recv-buffer=16384 --wsesslog=700,0.000,input.txt
Maximum connect burst length: 2

Total: connections 700 requests 11553 replies 11226 test-duration 35.479 s

Connection rate: 19.7 conn/s (50.7 ms/conn, <=671 concurrent connections)
Connection time [ms]: min 78.2 avg 7731.1 max 19545.7 median 7229.5 stddev 5358.7
Connection time [ms]: connect 0.5
Connection length [replies/conn]: 374.200

Request rate: 325.6 req/s (3.1 ms/req)
Request size [B]: 105.0

Reply rate [replies/s]: min 83.2 avg 316.0 max 444.6 stddev 137.0 (7 samples)
Reply time [ms]: response 111.7 transfer 0.0
Reply size [B]: header 221.0 content 2162.0 footer 0.0 (total 2383.0)
Reply status: 1xx=0 2xx=11226 3xx=0 4xx=0 5xx=0

CPU time [s]: user 27.61 system 7.86 (user 77.8% system 22.2% total 100.0%)
Net I/O: 770.1 KB/s (6.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 11226 
Session rate [sess/s]: min 0.20 avg 0.85 max 1.40 stddev 0.39 (30/30)
Session: avg 1.00 connections/session
Session lifetime [s]: 7.7
Session failtime [s]: 0.0
Session length histogram: 0 0 1 2 2 1 1 6 5 1 1 0 2 1 0 1 2 0 0 1 0 1 1 0 1