fixed_bottleneck/original/httperf/test4.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=44.252.104.243 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.05 --send-buffer=4096 --recv-buffer=16384 --wsesslog=700,0.000,input.txt
Maximum connect burst length: 2

Total: connections 700 requests 11083 replies 10718 test-duration 35.587 s

Connection rate: 19.7 conn/s (50.8 ms/conn, <=672 concurrent connections)
Connection time [ms]: min 84.2 avg 8881.3 max 32941.3 median 7379.5 stddev 7410.5
Connection time [ms]: connect 0.5
Connection length [replies/conn]: 357.267

Request rate: 311.4 req/s (3.2 ms/req)
Request size [B]: 105.0

Reply rate [replies/s]: min 83.6 avg 301.0 max 415.0 stddev 124.6 (7 samples)
Reply time [ms]: response 126.0 transfer 0.0
Reply size [B]: header 221.0 content 2164.0 footer 0.0 (total 2385.0)
Reply status: 1xx=0 2xx=10718 3xx=0 4xx=0 5xx=0

CPU time [s]: user 26.84 system 8.74 (user 75.4% system 24.6% total 100.0%)
Net I/O: 733.8 KB/s (6.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 10718 
Session rate [sess/s]: min 0.20 avg 0.84 max 1.20 stddev 0.37 (30/30)
Session: avg 1.00 connections/session
Session lifetime [s]: 8.9
Session failtime [s]: 0.0
Session length histogram: 0 0 1 2 2 0 1 6 5 1 1 0 2 1 0 1 2 0 0 1 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1