fixed_bottleneck/original/httperf/test5.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=44.252.104.243 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.05 --send-buffer=4096 --recv-buffer=16384 --wsesslog=700,0.000,input.txt
Maximum connect burst length: 2

Total: connections 700 requests 10962 replies 10620 test-duration 35.405 s

Connection rate: 19.8 conn/s (50.6 ms/conn, <=672 concurrent connections)
Connection time [ms]: min 77.0 avg 7405.9 max 20035.6 median 7228.5 stddev 5124.7
Connection time [ms]: connect 0.5
Connection length [replies/conn]: 366.207

Request rate: 309.6 req/s (3.2 ms/req)
Request size [B]: 105.0

Reply rate [replies/s]: min 83.6 avg 299.3 max 417.4 stddev 123.5 (7 samples)
Reply time [ms]: response 136.9 transfer 0.0
Reply size [B]: header 221.0 content 2165.0 footer 0.0 (total 2386.0)
Reply status: 1xx=0 2xx=10620 3xx=0 4xx=0 5xx=0

CPU time [s]: user 26.56 system 8.84 (user 75.0% system 25.0% total 100.0%)
Net I/O: 731.1 KB/s (6.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 10620 
Session rate [sess/s]: min 0.20 avg 0.82 max 1.40 stddev 0.42 (29/29)
Session: avg 1.00 connections/session
Session lifetime [s]: 7.4
Session failtime [s]: 0.0
Session length histogram: 0 0 1 2 2 1 1 6 5 1 1 0 2 1 0 1 2 0 0 1 0 0 1 0 1